Show / Hide Table of Contents
Class BoltParam
Parameter which represts the record of the bolt in IDEA MPRL
Inheritance
System.Object
MprlRecord
BoltParam
AnchorParam
Inherited Members
 MprlRecord.Name
 MprlRecord.TableId
 MprlRecord.ItemId
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Parameters
Assembly: IdeaRS.OpenModel.dll
Syntax
[DataContract]
[Serializable]
public class BoltParam : MprlRecord
Properties
Improve this Doc   View Source
Angles
Gets or sets the groups and positions for angles.
Declaration
[DataMember]
public NumberGroups Angles { get; set; }
Property Value
 Type |  Description
 NumberGroups
Improve this Doc   View Source
BoltInteraction
Indicates type of shear transfer
Declaration
[DataMember]
public BoltShearType BoltInteraction { get; set; }
Property Value
 Type |  Description
 BoltShearType
Improve this Doc   View Source
Cols
Gets or sets the columns of fasteners positions.
Declaration
[DataMember]
public NumberGroups Cols { get; set; }
Property Value
 Type |  Description
 NumberGroups
Improve this Doc   View Source
ColsGridType
Gets or sets the type of cols - regular or shifted.
Declaration
[DataMember]
public ConnectorGridType ColsGridType { get; set; }
Property Value
 Type |  Description
 ConnectorGridType
Improve this Doc   View Source
ColsNegative
Gets or sets the rows of a negative fasteners positions in case of RowsPosition equals to Profile. Absolute positions of groups, in group are relative positions.
Declaration
[DataMember]
public NumberGroups ColsNegative { get; set; }
Property Value
 Type |  Description
 NumberGroups
Improve this Doc   View Source
ColsPosition
Gets or sets the position, to which are bolt columns realted to.
Declaration
[DataMember]
public PositionRelatedTo ColsPosition { get; set; }
Property Value
 Type |  Description
 PositionRelatedTo
Improve this Doc   View Source
ColsSymmetry
Gets or sets the type of symmetry of columns positions.
Declaration
[DataMember]
public Symmetry ColsSymmetry { get; set; }
Property Value
 Type |  Description
 Symmetry
Improve this Doc   View Source
CoordinateSystem
Gets or sets the coordinate system type.
Declaration
[DataMember]
public CoordinateSystemMethod CoordinateSystem { get; set; }
Property Value
 Type |  Description
 CoordinateSystemMethod
Improve this Doc   View Source
Counts
Gets or sets the count of bolts in the circle (polar coordinate system).
Declaration
[DataMember]
public IList<int> Counts { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.IList<System.Int32>
Improve this Doc   View Source
PolarInput
Gets or sets the type, that spefifies polar input.
Declaration
[DataMember]
public PolarInputType PolarInput { get; set; }
Property Value
 Type |  Description
 PolarInputType
Improve this Doc   View Source
PolarPosition
Gets or sets the position, to which are bolt radii realted to (polar coordinate system).
Declaration
[DataMember]
public PositionRelatedTo PolarPosition { get; set; }
Property Value
 Type |  Description
 PositionRelatedTo
Improve this Doc   View Source
Positions
Gets or sets the fasteners positions {X, Y}.
Declaration
[DataMember]
public List<Point> Positions { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<System.Windows.Point>
Improve this Doc   View Source
Radii
Gets or sets the radii of bolts (polar coordinate system).
Declaration
[DataMember]
public NumberGroups Radii { get; set; }
Property Value
 Type |  Description
 NumberGroups
Improve this Doc   View Source
Rows
Gets or sets the rows of a fasteners positions. Absolute positions of groups, in group are relative positions.
Declaration
[DataMember]
public NumberGroups Rows { get; set; }
Property Value
 Type |  Description
 NumberGroups
Improve this Doc   View Source
RowsGridType
Gets or sets the type of rows - regular or shifted.
Declaration
[DataMember]
public ConnectorGridType RowsGridType { get; set; }
Property Value
 Type |  Description
 ConnectorGridType
Improve this Doc   View Source
RowsNegative
Gets or sets the rows of a negative fasteners positions in case of RowsPosition equals to Profile. Absolute positions of groups, in group are relative positions.
Declaration
[DataMember]
public NumberGroups RowsNegative { get; set; }
Property Value
 Type |  Description
 NumberGroups
Improve this Doc   View Source
RowsPosition
Gets or sets the position, to which are bolt rows realted to.
Declaration
[DataMember]
public PositionRelatedTo RowsPosition { get; set; }
Property Value
 Type |  Description
 PositionRelatedTo
Improve this Doc   View Source
RowsSymmetry
Gets or sets the type of symmetry of rows positions.
Declaration
[DataMember]
public Symmetry RowsSymmetry { get; set; }
Property Value
 Type |  Description
 Symmetry
Improve this Doc   View Source
ShearInThread
Indicates, whether a shear plane is in the thread of a bolt.
Declaration
[DataMember]
public bool ShearInThread { get; set; }
Property Value
 Type |  Description
 System.Boolean
 Improve this Doc
 View Source